import random

EXTRA_MODULES = [
    'group_id',  # 0
    'setujinyan',  # 1
    'help',  # 2
    'ipackage',  # 3
    'legend_box',  # 4
    'fusion',  # 5
    'sell',  # 6
    'drillshop',  # 7
    'danwang',  # 8
    'chaoshen',  # 9
    'Sboomerang',  # 10
    'strength',  # 11
    'monijinglian',  # 12
    'signin',  # 13
    'gold_query',  # 14
    'gold_present',  # 15
    'gold_shop',  # 16
    'rob',  # 17
    'gamble',  # 18
    'guess_coin',  # 19
    'wawale',  # 20
    'heisi',  # 21
    'leavemsg',  # 22
    'leave_private_msg',  # 23
    'left_msg',  # 24
    'left_msg_all',  # 25
    'love',  # 26
    'kiss',  # 27
    'away',  # 28
    'sleep_time',  # 29
    'sleep_list',  # 30
    'group_release_all',  # 31
    'open_baozhu',
    'blessing',

]

EXTRA_MODULES2 = [
    '涩图禁言',  # 1
    '仓库',  # 3
    '神器盒子',  # 4
    '模拟熔炼',  # 5
    '出售物品',  # 6
    '钻头商城',  # 7
    '弹王兑换',  # 8 9 10
    '模拟强化',  # 11
    '模拟精炼',  # 12
    '签到',  # 13 14 15 16
    '抢劫',  # 17
    '金币小游戏',  # 18 19 20
    '留言',  # 22 23 24 25
    '小师妹交流',  # 26 27 28 21
    '睡眠套餐',  # 29 30 31

]

EXTRA_MODULES3 = [[1], [3], [4], [5], [6], [7], [8, 9, 10], [11], [12], [13, 14, 15, 16], [17], [18, 19, 20],
                  [22, 23, 24, 25], [28, 27, 28, 21], [29, 30, 31]]

ITEM_NICKNAME = {
    0: ('真·爱心回力标初级碎片', '标初碎', '爱心初碎'),
    1: ('真·牛头怪初级碎片', '牛初碎', '牛头初碎'),
    2: ('真·远古竹枪初级碎片', '牙签初碎', "竹签初碎", '竹枪初碎', '竹签初碎'),
    3: ('真·小鸡初级碎片', "鸡初碎", "小鸡初碎"),
    4: ('真·爱心回力标高级碎片', '标高碎', '标碎'),
    5: ('真·牛头怪高级碎片', '牛碎', '牛高碎'),
    6: ('真·远古竹枪高级碎片', '枪碎', '牙签高碎', '牙签碎', '竹枪高碎', '竹枪碎'),
    7: ('真·小鸡高级碎片', '鸡碎', '小鸡高碎'),
    8: ('真·爱心回力标', "真标", "真爱心"),
    9: ('真·牛头怪', "真牛", "真牛头"),
    10: ('真·远古竹枪', "真牙签", "牙签", "竹枪", "竹签", "真枪"),
    11: ('真·疯狂小鸡', "鸡", "真鸡", "真小鸡"),
    12: ("巴罗夫的盾牌初级碎片", '巴顿初碎', '巴盾初碎'),
    13: ('巴罗夫的盾牌高级碎片', '巴顿高碎', '巴盾高碎', '巴顿碎片'),
    14: ('巴罗夫的盾牌', '巴顿', '巴盾'),
    15: ('真·天使之赐初级碎片', '奶初碎', '真天使初碎'),
    16: ('真·天使之赐高级碎片', '奶碎', '奶高碎', '真奶高碎', '真天使高碎'),
    17: ('真·天使之赐', '真奶', '真天使'),
    18: ('真·阿瑞斯的庇护', "真阿",),
    19: ('开孔钻头1级', '1级钻头', '钻头'),
    20: '开孔钻头1级*5',
    21: '开孔钻头1级*50',
    22: ('1级强化石', "强化石1级", "强1",),
    23: ('2级强化石', "强化石2级", "强2",),
    24: ('3级强化石', "强化石3级", "强3",),
    25: ('4级强化石', "强化石4级", "强4",),
    26: ('5级强化石', "强化石5级", "强5",),
    27: '金币',
    28: ("幸运符15%", "15符", "15幸运符", "幸运符15"),
    29: ("幸运符25%", "25符", "25幸运符", "幸运符25"),
    30: ("弹王回力标", "弹王"),
    31: ("极·爱心回力标", "极标"),
    32: ("收割者之镰", "镰刀"),
    33: ("加农神炮", "鱿鱼炮"),
    34: ("棒棒糖",),
    35: ("捣蛋鬼", "南瓜", "南瓜炮"),
    36: ("花之恋",),
    37: ("碎石斧",),
    38: ("AK-48",),
    39: ("黄金枪",),
    40: ("真·轰天", "真轰天", "大炮"),
    41: ("极·司马砸缸", "极司马", "板砖"),
    42: ("极·飞天跑车", "跑车"),
    43: ("啵咕盾牌", "啵咕盾", "bg盾牌", "bg盾"),
    44: ("随机宝珠Lv4",),
    45: ("神恩符", "神恩"),
    46: ("极·轰天",),
    47: ("极·烈火",),
    48: ("极·雷霆",),
    49: ("极·神风",),
    50: ("极·黑白家电",),
    51: ("极·畅通利器",),
    52: ("极·牛顿水果篮",),
    53: ("极·医用工具箱",),
    54: ("攻击祝福宝珠",),
    98: ("情定终生+5",),
    99: ("情定终生",),

}

# 神器盒子概率
BOX = {
    # 总和 10000，概率为万分之以下数字
    226: 1600,  # 标初碎
    221: 1600,  # 牛初碎
    222: 1600,  # 枪初碎
    223: 0,  # 鸡初碎
    236: 398,  # 标高碎
    231: 398,  # 牛高碎
    232: 398,  # 枪高碎
    233: 0,  # 鸡高碎
    8: 2,  # 真标
    9: 2,  # 真牛
    10: 2,  # 真牙签
    11: 0,  # 真鸡
    12: 0,  # 巴顿初碎
    13: 0,  # 巴顿高碎
    14: 0,  # 巴顿
    15: 0,  # 真奶初碎
    16: 0,  # 真奶高碎
    17: 0,  # 真奶
    18: 0,  # 真阿瑞斯
    19: 3000,  # 1级钻头*2
    20: 980,  # 1级钻头*5
    21: 20  # 1级钻头*50
}

"""
(226,3,500),
(226,1,1000),
(221,3,500),
(221,1,1000),
(222,3,500),
(222,1,1000),
(223,3,500),
(223,1,1000)
(236,3,300),
(231,1,300),
(232,1,300),
(233,1,300),
(224,2,200),
(224,1,800),
(225,1,600),
(225,2,400),
(234,1,200),
(235,1,100),
(1,1,1),
(2,1,1),
(3,1,1),
(4,1,1),
(101,1,2),
(301,1,1),
(206,1,5)




"""


# 钻头抽奖概率：
PRIZE_DRAW = {
    # 总和 10000，概率为万分之以下数字
    # 物品编号：概率
    0: 400,  # 标初碎
    1: 400,  # 牛初碎
    2: 400,  # 枪初碎
    3: 1200,  # 鸡初碎
    4: 100,  # 标高碎
    5: 100,  # 牛高碎
    6: 100,  # 枪高碎
    7: 300,  # 鸡高碎
    8: 1,  # 真标
    9: 1,  # 真牛
    10: 1,  # 真牙签
    11: 2,  # 真鸡
    12: 800,  # 巴顿初碎
    13: 400,  # 巴顿高碎
    14: 3,  # 巴顿
    15: 1100,  # 真奶初碎
    16: 400,  # 真奶高碎
    17: 3,  # 真奶
    18: 0,  # 真阿瑞斯
    19: 0,  # 金币*1
    20: 0,  # 金币*10
    21: 19,  # 金币*100
    22: 800,  # 1级强化石
    23: 800,  # 2级强化石
    24: 500,  # 3级强化石
    25: 300,  # 4级强化石
    26: 170,  # 5级强化石
    28: 450,  # 幸运符15%
    29: 240,  # 幸运符25%
    44: 10,  # 神恩符
}

ITEM_SHOP_PRICE = {
    37: 100,  # 碎石
    38: 130,  # AK-48
    39: 150,  # 黄金枪
    40: 200,  # 真轰天
    41: 300,  # 极司马
    42: 1000,  # 极跑车
    18: 0
}

WEAPON_DAMAGE = {  # 武器伤害
    8: 24.2,  # 真标
    9: 24.2,  # 真牛
    10: 24.2,  # 真牙签
    11: 24.2,  # 真小鸡
    30: 27.5,  # 弹王
    31: 28.5,  # 极标
    32: 25.7,  # 镰刀
    33: 25.7,  # 鱿鱼炮
    34: 25.7,  # 棒棒糖
    35: 25.7,  # 南瓜
    36: 24.7,  # 花之恋
    37: 17.5,  # 碎石斧
    38: 18,  # AK-48
    39: 18.5,  # 黄金枪
    40: 19,  # 真轰天
    41: 22,  # 极司马
    42: 23,  # 极跑车
}

STRENGTH_STONE = [
    0,
    75,
    300,
    1200,
    4800,
    24000
]

STRENGTH_EXP = [
    200,
    700,
    2700,
    10700,
    21300,
    42700,
    85300,
    170700,
    293300,
    512000,
    682700,
    853300
]

item_list1 = {
    "真·爱心回力标": 4,
    "真·远古竹枪": 4,
    "真·牛头怪": 4,
    "真·天使之赐": 4,
    "巴罗夫的盾牌": 4,
    "真·阿瑞斯的庇护": 4,
    "极·轰天": 149,
    "极·烈火": 149,
    "极·雷霆": 149,
    "极·神风": 149,
    "极·黑白家电": 148,
    "极·畅通利器": 148,
    "极·牛顿水果篮": 148,
    "极·医用工具箱": 148,
    "极·司马砸缸": 148,
}
item_list3 = {
    "真·爱心回力标": 4,
    "真·远古竹枪": 4,
    "真·牛头怪": 4,
    "真·天使之赐": 4,
    "巴罗夫的盾牌": 12,
    "真·阿瑞斯的庇护": 1,
}
item_list2 = {
    "真·爱心回力标": 4,
    "真·远古竹枪": 4,
    "真·牛头怪": 4,
    "真·天使之赐": 4,
    "巴罗夫的盾牌": 4,
    "真·阿瑞斯的庇护": 4,
    "S攻击宝珠-豹速Lv4": 45,
    "S攻击宝珠-强击Lv4": 45,
    "S攻击宝珠-枷锁Lv4": 45,
    "S攻击宝珠-穿甲Lv4": 45,
    "S攻击宝珠-赐福Lv4": 45,
    "S攻击宝珠-弱化Lv4": 45,
    "S攻击宝珠-吸血Lv4": 45,
    "S攻击宝珠-暴击Lv4": 45,
    "S攻击宝珠-核爆Lv4": 45,
    "S攻击宝珠-寒冰Lv4": 45,
    "S攻击宝珠-封印Lv4": 44,
    "S攻击宝珠-连击Lv4": 44,
    "S攻击宝珠-灼烧Lv4": 44,
    "S攻击宝珠-重伤Lv4": 45,
    "S攻击宝珠-引导Lv4": 45,
    "S防御宝珠-吸收Lv4": 45,
    "S防御宝珠-减伤Lv4": 44,
    "S防御宝珠-恢复Lv4": 45,
    "S防御宝珠-激怒Lv4": 45,
    "S防御宝珠-坚韧Lv4": 45,
    "S防御宝珠-免坑Lv4": 45,
    "S防御宝珠-石肤Lv4": 45,
    "S属性宝珠-伤害Lv4": 45,
    "S属性宝珠-护甲Lv4": 45,
    "S属性宝珠-攻击Lv4": 45,
    "S属性宝珠-防御Lv4": 45,
    "S属性宝珠-敏捷Lv4": 45,
    "S属性宝珠-幸运Lv4": 45,
}
item_list4 = {
    "攻击宝珠-豹速Lv4": 20,
    "攻击宝珠-强击Lv4": 20,
    "攻击宝珠-枷锁Lv4": 20,
    "攻击宝珠-穿甲Lv4": 20,
    "攻击宝珠-赐福Lv4": 20,
    "攻击宝珠-弱化Lv4": 20,
    "攻击宝珠-吸血Lv4": 20,
    "攻击宝珠-暴击Lv4": 20,
    "攻击宝珠-核爆Lv4": 20,
    "攻击宝珠-寒冰Lv4": 20,
    "攻击宝珠-封印Lv4": 20,
    "攻击宝珠-连击Lv4": 20,
    "攻击宝珠-灼烧Lv4": 20,
    "攻击宝珠-重伤Lv4": 20,
    "攻击宝珠-引导Lv4": 20,
    "防御宝珠-吸收Lv4": 20,
    "防御宝珠-减伤Lv4": 20,
    "防御宝珠-恢复Lv4": 20,
    "防御宝珠-激怒Lv4": 20,
    "防御宝珠-坚韧Lv4": 20,
    "防御宝珠-免坑Lv4": 20,
    "防御宝珠-石肤Lv4": 20,
    "属性宝珠-伤害Lv4": 20,
    "属性宝珠-护甲Lv4": 20,
    "属性宝珠-攻击Lv4": 20,
    "属性宝珠-防御Lv4": 20,
    "属性宝珠-敏捷Lv4": 20,
    "属性宝珠-幸运Lv4": 20,
    "S攻击宝珠-豹速Lv4": 1,
    "S攻击宝珠-强击Lv4": 1,
    "S攻击宝珠-枷锁Lv4": 1,
    "S攻击宝珠-穿甲Lv4": 1,
    "S攻击宝珠-赐福Lv4": 1,
    "S攻击宝珠-弱化Lv4": 1,
    "S攻击宝珠-吸血Lv4": 1,
    "S攻击宝珠-暴击Lv4": 1,
    "S攻击宝珠-核爆Lv4": 1,
    "S攻击宝珠-寒冰Lv4": 1,
    "S攻击宝珠-封印Lv4": 1,
    "S攻击宝珠-连击Lv4": 1,
    "S攻击宝珠-灼烧Lv4": 1,
    "S攻击宝珠-重伤Lv4": 1,
    "S攻击宝珠-引导Lv4": 1,
    "S防御宝珠-吸收Lv4": 1,
    "S防御宝珠-减伤Lv4": 1,
    "S防御宝珠-恢复Lv4": 1,
    "S防御宝珠-激怒Lv4": 1,
    "S防御宝珠-坚韧Lv4": 1,
    "S防御宝珠-免坑Lv4": 1,
    "S防御宝珠-石肤Lv4": 1,
    "S属性宝珠-伤害Lv4": 1,
    "S属性宝珠-护甲Lv4": 1,
    "S属性宝珠-攻击Lv4": 1,
    "S属性宝珠-防御Lv4": 1,
    "S属性宝珠-敏捷Lv4": 1,
    "S属性宝珠-幸运Lv4": 1,
}


# 加权随机函数

def overrandom(box: dict):
    """
    加权随机函数：
    从box中的所有物品进行加权随机
    :param box:键为要进行随机选取的物品名称，值为所占的权重
    :return: 随机结果
    """
    sum0 = sum(box.values())
    randomnum = random.randint(0, sum0 - 1)
    for items in box:
        if randomnum < box[items]:
            return items
        else:
            randomnum -= box[items]


def dict_to_list(input_dict: dict):
    _j = 0
    _item_list = []
    for i in input_dict.keys():
        _item_list.append(i)
        _j += 1
    return _item_list


BAOZHU = dict_to_list(item_list4)
